{"pages":[],"posts":[{"title":"How to set up a hexo blog","text":"In this article, you will find how to set up a hexo blog and deploy it. Special thanks to Codesheep’s video 0. Pre-requisiteThe most important of all, don’t be afraid of making mistakes! To initiate your blog, you will need the libraries below. 0.1 Node.js Download here - suggest LTS version To check whether Node.js was downloaded successfully, type node -v in the terminal window. If something like v12.18.2 is presented with no error message, you are free to go for the next step. For Windows users, terminal could be invoked by pressing win + R, and then type cmd in the prompt window. 0.2 npmnpm is the default package management tool for Node.js. For Chinese users, you could switch to the mirror in cnpm for faster downloads. Run the command to install cnpm: 1$ npm install -g cnpm --registry=https://registry.npm.taobao.org Similar to Node.js, type npm -v to check if it’s installed successfully. 0.3 Gitgit is a version control tool used widely among programming projects. Generally speaking, it could help you keep different versions of your project. Download here To configure the git globally, you could run the command after installation. In the command, --global would set the following parameters for all git repositories on your computer. 12$ git config --global user.name &quot;Your Namee&quot;$ git config --global user.email &quot;email@example.com&quot; 0.4 hexoWith the package management tool installed, fetch the hexo package using command: 1$ npm install -g hexo or: 1$ cnpm install -g hexo Similar to Node.js, type hexo -v to check if it’s installed successfully. 1. Initiate blog Create a folder 1$ mkdir blog By default, this blog/ folder will be created in /Users/YourUserName/ for both Mac and Windows users. Navigate into the folder 1$ cd blog To check if you are in the right folder, type pwd to check. Initiate your blog ==Make sure you are in the right folder before running command below!== 1$ sudo hexo init The sudo parameter refers to admin access. Run your blog! 1$ hexo s By default, you will see the blog running at http://localhost:4000 2. Create a new articleAs indicated in the default blog file helloworld.md, you could use the command below to create a new blog. 1$ hexo n &quot;Your artical title&quot; By default, it will be created in source/_posts folder. For markdown reference, please check here. After writing, use the following command to clean the database and generate static files for local blog. 123$ hexo clean$ hexo generate$ hexo server Vist the default link again, you could see the article you just wrote. 3. Deploy your blog You will need a Github account or Gitee accound for deployment. Github Create a new repository with the name YourFullUserName.github.io and it has to be set to public. Install a plugin for deployment. 1$ npm install --save hexo-deployer-git Find the _config.yml file in your blog folder, at the end of this file, modify the following content: 123456# Deployment## Docs: https://hexo.io/docs/deployment.htmldeploy: type: git repo: Your Github repo's link branch: master Your repo link should end with .github.io.git which you could obtain here. After saving your config file, run command below to deploy your blog. 1$ hexo d You may need to type your user name and password. See you blog online! Visit yourUserName.github.io Gitee#TODO References Codesheep’s video in Chinese","link":"/2021/11/28/How-to-set-up-a-hexo-blog/"},{"title":"Intention of this blog","text":"Aims Record feelings and findings during CS study. Share my project experience with reproduceble steps. Publish notes about courses and libraies. To be continued…With more posts, this article will serve as an index page.","link":"/2021/08/18/Intention-of-this-blog/"},{"title":"Hello World","text":"Welcome to Hexo! This is your very first post. Check documentation for more info. If you get any problems when using Hexo, you can find the answer in troubleshooting or you can ask me on GitHub. Quick StartCreate a new post1$ hexo new &quot;My New Post&quot; More info: Writing Run server1$ hexo server More info: Server Generate static files1$ hexo generate More info: Generating Deploy to remote sites1$ hexo deploy More info: Deployment","link":"/2021/08/17/hello-world/"}],"tags":[{"name":"blog","slug":"blog","link":"/tags/blog/"},{"name":"translation","slug":"translation","link":"/tags/translation/"}],"categories":[]}